slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Introduction to GitHub Actions</title>
<meta name="author" content="(Marius Bakke)"/>
<link rel="stylesheet" href="./reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/dist/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="./reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Introduction to GitHub Actions</h1><h2 class="author">Marius Bakke</h2><p class="date">Created: 2021-09-09 Thu 13:12</p>
</section>

<section>
<section id="slide-orgac7a631">
<h2 id="orgac7a631">What are GitHub Actions?</h2>
<aside class="notes">
<p>
The goal of this presentation is to answer this question along with practical examples.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org35c493c">
<h2 id="org35c493c">GitHub <del>Actions</del> Events</h2>
<ul>
<li>GitHub Actions is an event-driven declarative job scheduling system.</li>

</ul>
<ul>
<li data-fragment-index="1" class="fragment roll-in">Actions are declared through workflow files, containing event triggers and jobs.</li>
<li data-fragment-index="2" class="fragment roll-in">Repositories can have multiple workflows.</li>

</ul>

<aside class="notes">
<p>
"CI system" mostly a side effect.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org67d35b1">
<h2 id="org67d35b1">Custom workflow language</h2>
<ul>
<li>YAML</li>
<li>Shell scripts</li>

</ul>

<aside class="notes">
<p>
I know what you are thinking&#x2026;
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orga7294db" data-background="./images/what_could_go_wrong.jpg" data-background-size="contain" data-background-position="center" data-background-repeat="no-repeat" data-background-transition="slide">
<h2 id="orga7294db"></h2>

</section>
</section>
<section>
<section id="slide-orgd3593c9" data-auto-animate>
<h2 id="orgd3593c9">Anatomy of a workflow</h2>
<div class="org-src-container">

<pre    data-id="event-types"><code class="yaml" >---
on:
  push:
    branches: ['master']
jobs:
  have-faith:
    runs-on: ubuntu-latest
    steps:
      - run: echo "Good luck! 🤞"
</code></pre>
</div>

<aside class="notes">
<p>
Comparison to other CI systems.
Jenkins, Gitlab runners, etc.
Custom runners.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org95043b6" data-auto-animate>
<h2 id="org95043b6">Event triggers</h2>
<div class="org-src-container">

<pre    data-id="event-types"><code class="yaml" >---
on:
  push:
  pull_request:
  workflow_dispatch:
  schedule: '0 12 * * *'
</code></pre>
</div>

<aside class="notes">
<p>
The job can be dispatched from other jobs or through API calls.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org72583d6" data-auto-animate>
<h2 id="org72583d6">Python example</h2>
<div class="org-src-container">

<pre    data-id="python-example"><code class="yaml" data-line-numbers=''>jobs:
  test:
    steps:
      - name: Checkout
	uses: actions/checkout@v2
      - name: Install Python
	uses: actions/setup-python@v2
	with:
	 python-version: 3.9
      - name: Install dependencies
	run: pip install -r requirements.txt
      - name: Run tests
	run: pytest -vv
</code></pre>
</div>

<aside class="notes">
<p>
Excerpt from <a href="https://github.com/unioslo/mreg">https://github.com/unioslo/mreg</a>
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org628a92d" data-auto-animate>
<h2 id="org628a92d">Test matrix</h2>
<div class="org-src-container">

<pre    data-id="python-example"><code class="yaml" data-line-numbers='3,4,5,12'>jobs:
  test:
    strategy:
      matrix:
	python-version: ['3.7', '3.8', '3.9']
    steps:
      - name: Checkout
	uses: actions/checkout@v2
      - name: Install Python
	uses: actions/setup-python@v2
	with:
	  python-version: ${{ matrix.python-version }}
      - name: Install dependencies
	run: pip install -r requirements.txt
      - name: Run tests
	run: pytest -vv
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgdabf08e" data-auto-animate>
<h2 id="orgdabf08e">Artifacts</h2>
<div class="org-src-container">

<pre    data-id="artifact"><code class="yaml" data-line-numbers='7,13-17'>jobs:
  build:
    steps:
      - name: Create container image
	run: &gt;
	  guix pack -f docker
	  --root=nivlheim-image.tar.gz
	  --entry-point=bin/nivlheim
	  -S /etc/profile=etc/profile
	  --with-source=nivlheim=$PWD
	  nivlheim

      - name: Upload artifact
	uses: actions/upload-artifact@v2
	with:
	  name: nivlheim-image.tar.gz
	  path: nivlheim-image.tar.gz
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-org068bb79" data-auto-animate>
<h2 id="org068bb79">Conditionals</h2>
<div class="org-src-container">

<pre    data-id="artifact"><code class="yaml" data-line-numbers='2,10,11,12'>jobs:
  build:
    steps:
      [...]
      - name: Upload artifact
	uses: actions/upload-artifact@v2
	with:
	  name: nivlheim-image.tar.gz
	  path: nivlheim-image.tar.gz
  publish:
    if: ${{ github.ref == 'refs/heads/master' }}
    needs: build
    steps:
      - name: Download artifact
</code></pre>
</div>

<aside class="notes">
<p>
No state is shared between jobs.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org4fbd775">
<h2 id="org4fbd775">Service containers</h2>
<div class="org-src-container">

<pre   ><code class="yaml" data-line-numbers='4,6,8,10,12,13,14'>runs-on: ubuntu-latest
services:
  postgres:
    image: postgres:latest
  mreg:
    image: ghcr.io/unioslo/mreg:latest
    env:
      MREG_DB_HOST: postgres
    ports:
      - 8000:8000
steps:
  - run: &gt;
      echo -ne 'test\nsource testsuite\nquit\n'
      | mreg-cli -u ci -d example.org --url http://localhost:8000
</code></pre>
</div>
</section>
</section>
</div>
</div>
<script src="./reveal.js/dist/reveal.js"></script>
<script src="./reveal.js/plugin/highlight/highlight.js"></script>
<script src="./reveal.js/plugin/notes/notes.js"></script>


<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
plugins: [RevealHighlight, RevealNotes],
transition:'none'
});

</script>
</body>
</html>
